integrarium/stm32_ventil_slave/main.c
//I2C-датчик XGZP6897 плата сентябрь 2022

#include <math.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>
#include <stm32f10x_adc.h>
#include <stm32f10x_tim.h>
#include <stm32f10x_dma.h>
#include <stm32f10x_i2c.h>
#include <stm32f10x_usart.h>
#include <stm32f10x_flash.h>
#include <stm32f10x_bkp.h>
//#include <stm32f10x_rtc.h>

#include <I2C_slave.h>

#include <delay.h>
#include <main.h>


void init_gpio(void)
{
  GPIO_InitTypeDef gpio;
  GPIO_StructInit(&gpio);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
  gpio.GPIO_Mode = GPIO_Mode_AF_PP;
  gpio.GPIO_Pin = GPIO_Pin_8;
  GPIO_Init(GPIOA, &gpio);
}

// -----------------  DMA config ---------------------------------------

void DMA_Configuration(DMA_InitTypeDef *DMA_InitStructure)
{
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE); /* Enable DMA clock */

  //ADC1
  DMA_Cmd(DMA1_Channel1, DISABLE);
  DMA_DeInit(DMA1_Channel1);
  DMA_InitStructure->DMA_PeripheralBaseAddr = (uint32_t) &ADC1->DR;
  DMA_InitStructure->DMA_MemoryBaseAddr = (uint32_t) ADC_DMA_buffer;
  DMA_InitStructure->DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure->DMA_BufferSize = 2;
  DMA_InitStructure->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure->DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure->DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure->DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure->DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure->DMA_Priority = DMA_Priority_VeryHigh;
  DMA_InitStructure->DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA1_Channel1, DMA_InitStructure);
  DMA_Cmd(DMA1_Channel1, ENABLE);

}
//---------- adc конфиг  -----------------------------------------

void ADC_Config(void)
{
  GPIO_InitTypeDef	GPIO_InitStructure;
  ADC_InitTypeDef	ADC_InitStructure;

  /* Configure the ADC clock (must not exceed 14MHz) */
  RCC_ADCCLKConfig(RCC_PCLK2_Div8);

  /* Enable ADC1 clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

  /* ADC Channel configuration */
  /* ADC GPIO clock enable */
//  RCC_APB2PeriphClockCmd(ADC_GPIO_CLK, ENABLE);  GPIOB

  /* Configure ADC1 Channel9 as analog input */
//  GPIO_InitStructure.GPIO_Pin = ADC_GPIO_PIN ;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
//  GPIO_Init(ADC_GPIO_PORT, &GPIO_InitStructure);

  /* ADC1 configuration */
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 2;
  ADC_Init(ADC1, &ADC_InitStructure);

  // положение резистора
  /* ADC1 regular channel9 configuration */
  ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_239Cycles5); //самое медленное преобразование

  // температура МК
  /* ADC1 regular channel16 configuration */
  ADC_RegularChannelConfig(ADC1, ADC_Channel_16, 2, ADC_SampleTime_239Cycles5); //самое медленное преобразование

  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);

  /* Enable ADC1 reset calibration register */
  ADC_ResetCalibration(ADC1);

  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1))
  {
  }

  /* Start ADC1 calibration */
  ADC_StartCalibration(ADC1);

  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));

  /* Start ADC1 Software Conversion */
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);

  ADC_DMACmd(ADC1, ENABLE); // DMA enabling -----------------------------------------------

  ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE); //Разрешение прерывания

  NVIC_EnableIRQ(ADC1_2_IRQn); //Разрешение прерывания

}
//-------------- прерывание АЦП ----------------------
//срабатывает 1 раз на 2 преобразования (по каждому каналу)
//данные достаёт DMA и складывает в буфер ADC_DMA_buffer
//а тут мы только накапливаем их в float-переменных
float temperature_data[2];

void ADC1_2_IRQHandler(void)
  {
  u8 i;
    for (i=0;i<2;i++)
    {

		  if (abs(temperature_data[i]-ADC_DMA_buffer[i])<50)
		  temperature_data[i] = temperature_data[i]*0.95+ADC_DMA_buffer[i]*0.05;
      else	  temperature_data[i] = ADC_DMA_buffer[i];
    }
  }
// -----------------  RCC config ---------------------------------------

void RCC_Configuration(void)
{
  /* RCC system reset(for debug purpose) */
  RCC_DeInit();
  /* Enable HSE */
  RCC_HSEConfig(RCC_HSE_ON);
  /* Wait till HSE is ready */
  HSEStartUpStatus = RCC_WaitForHSEStartUp();
  if(HSEStartUpStatus == SUCCESS)
  {
    /* HCLK = SYSCLK */
    RCC_HCLKConfig(RCC_SYSCLK_Div1);
    /* PCLK2 = HCLK */
    RCC_PCLK2Config(RCC_HCLK_Div4);
    /* PCLK1 = HCLK/2 */
    RCC_PCLK1Config(RCC_HCLK_Div2);
    /* Flash 2 wait state */
    FLASH_SetLatency(FLASH_Latency_2);
    /* Enable Prefetch Buffer */
    FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);
    /* PLLCLK = 16MHz * 3 = 48 MHz */
    RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_3);

    /* Enable PLL */
    RCC_PLLCmd(ENABLE);
    /* Wait till PLL is ready */
    while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET){};
    /* Select PLL as system clock source */
    RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
    /* Wait till PLL is used as system clock source */
    while(RCC_GetSYSCLKSource() != 0x08) {};
  }
}
//---------- crc16 для модбаса	-----------------------------------------
unsigned int calculateCRC(u8 *frame, unsigned char bufferSize)
{
  u16 temp, temp2, flag;
  u8 i, j;
  temp = 0xFFFF;
  for (i = 0; i < bufferSize; i++)
  {
    temp = temp ^ frame[i];
    for (j = 1; j <= 8; j++)
    {
      flag = temp & 0x0001;
      temp >>= 1;
      if (flag)
	temp ^= 0xA001;
    }
  }
  // Reverse byte order.
  temp2 = temp >> 8;
  temp = (temp << 8) | temp2;
  temp &= 0xFFFF;
  // the returned value is already swapped
  // crcLo byte is first & crcHi byte is last
  return temp;
}

//--------------------------------------------------
u16 mSecondCounter; //счётчик миллисекунд
u16 SecondCounter; //счётчик секунд

void SysTick_Handler(void)
{

	mSecondCounter++;
	if (mSecondCounter>=1000)  //=48e6/(2^16)
	  {
		mSecondCounter=0;
		SecondCounter++;

