integrarium/stm32_ventil_slave/main.c
//	    TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Enable);
	  TIM_ITConfig (TIM3, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2, ENABLE);

	  NVIC_EnableIRQ(TIM3_IRQn); //Разрешение прерывания
	  TIM_Cmd(TIM3, ENABLE);
  }
//-------------- прерывание уарта ----------------------
u8 NumBytesToSend;

void USART2_IRQHandler(void)
{

	  u8 temp;
	    if ((USART2->SR) & USART_FLAG_RXNE)  //пришёл байт?
		  {
	      temp=USART2->DR;		 //принимаем байт
	      if ((RTCounter<100) & !GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_1))  //если буфер не кончился и передача не включена
		{
		    frame[RTCounter++]=temp;	     //кладём байт в буфер
	    TIM_SetCounter(TIM2,0xf000);     //сброс счётчика времени
	    TIM_Cmd(TIM2, ENABLE);	   //вкл таймера
		}
		  }
	    if ((USART2->SR) & USART_FLAG_TC)  //ушёл байт?
	      {
		if (RTCounter<NumBytesToSend)
		{
		    USART_SendData(USART2, frame[RTCounter++]); 	 //отправка следующего байта
		}
		else
		  {
				//завершение передачи
		    USART_ClearFlag (USART2, USART_FLAG_TC);  //чистим флаг
			GPIO_ResetBits(GPIOA, GPIO_Pin_1);	 // передача выкл
			RTCounter=0;
		  }

	      }
}

//------------- прерывание таймеров -------------------

s32 integrator;
u32 temp_tim3_1,temp_tim3_2;
u16 HighWordTimCnt;

void TIM3_IRQHandler (void)
  {
    s32 err_pres, power;
    u16 tim_flags;
    u32 temp_tim3;

    tim_flags = TIM3->SR;
//		TIM_GetFlagStatus(TIM3, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2);
    TIM_ClearFlag (TIM3, TIM_FLAG_Update | TIM_FLAG_CC1 | TIM_FLAG_CC2);	    //сброс флага
//    if (tim_flags != TIM_IT_Update)
//	{
//	 CorrConf[0]->FanTimCapt++;

//	}
    //temp_tim3 = ((HighWordTimCnt+1)<<16);
    //if (((temp_tim3-temp_tim3_1)>>10) > 0xffff) CorrConf[0]->FanSpeed = 0; //скорость меньше порога
    //if (((temp_tim3-temp_tim3_2)>>10) > 0xffff) CorrConf[1]->FanSpeed = 0; //скорость меньше порога

    if (tim_flags & TIM_FLAG_Update)  //частота = 48 МГц/65536 = 732 Гц
    {

	err_pres=0;
	HighWordTimCnt++;

	if ((CorrConf[0]->ustav>0) && (VentConf->fan_on>0) ) //если уставка не ноль и включение разрешено - работает регулятор
      {
      err_pres=VentConf->cur_flaw;   //регулируем по потоку
	  err_pres-=(CorrConf[0]->ustav);   //разница потока
	  integrator-=err_pres; 	  //накопление ошибки в интеграторе
	 // integrator+=16;
	  if (integrator<-(0xffff<<8)) integrator=-(0xffff<<8);    //ограничение интегратора
      if (integrator> (0xffff<<8)) integrator= (0xffff<<8);    //ограничение интегратора
//	  power=(integrator>>5)-(err_pres<<6);	//считаем мощность. коэффициенты заданы степенями двойки
	  power=(integrator>>8);  //считаем мощность. коэффициенты заданы степенями двойки
	  if (power<0) power=0; 		//мощность не может быть отрицательной
      if (power>0xffff) power=0xffff;	    //мощность не может быть > 100%
      }
    else
      {
	power=0;
	integrator=0;
      }
    if ((CorrConf[0]->WorkMode & 1)==0) //режим "регулятор расхода"
      {
	CorrConf[0]->power=power & 0xffff;
	VentConf->fan_power=power*10000/0xffff;
	CorrConf[0]->error=err_pres & 0xffff;
	TIM3->CCR3=power;  //перезапись расчитанной мощности в таймер
	TIM3->CCR4-=1;
      }
    }
    else if (tim_flags & TIM_FLAG_CC1)
      {
      temp_tim3 = (HighWordTimCnt<<16) | TIM3->CCR1;
//	CorrConf[0]->FanTimCapt = (temp_tim3-temp_tim3_1)>>10;
      if (((temp_tim3-temp_tim3_1)>>10) < 0xffff) CorrConf[1]->FanSpeed = 48000000/(temp_tim3-temp_tim3_1) ; //считаем скорость
      temp_tim3_1=temp_tim3;
      }
    else if (tim_flags & TIM_FLAG_CC2)
      {
      temp_tim3 = (HighWordTimCnt<<16) | TIM3->CCR2;
//	CorrConf[1]->FanTimCapt = (temp_tim3-temp_tim3_2)>>10;
      if (((temp_tim3-temp_tim3_2)>>10) < 0xffff) CorrConf[0]->FanSpeed = 48000000/(temp_tim3-temp_tim3_2) ; //скорость
      temp_tim3_2=temp_tim3;
      }

  }


void TIM2_IRQHandler (void)
{
u16 crc16, addr;
u16 temp, i;
u16 *p_devconf;

	//пакет принят

	TIM_Cmd(TIM2, DISABLE); 	//выкл таймера
	TIM_ClearFlag (TIM2, TIM_FLAG_Update);	    //сброс флага
    if (RTCounter>7)  //пакеты короче 8ми байт игнорируем
      {
      crc16 = frame[RTCounter-2]<<8|frame[RTCounter-1];
      if (crc16==calculateCRC(frame, RTCounter-2)) //crc совпал?
	{
	if ( (frame[0]==((CorrConf[0]->OurMBAddress)&0xff)) || (frame[0]==0)/*| (frame[0]==((CorrConf[1]->OurMBAddress)&0xff))*/)  //проверка адреса
	  {
//		if (frame[0]==((CorrConf[0]->OurMBAddress)&0xff))
//		  {
			p_devconf=(u16 *)(& (dev_conf[0]));
//		  }
//		else p_devconf=(u16 *)(& (dev_conf[1])); //обращение по второму модбас-адресу

		switch (frame[1])
		{
		case 3: 	//запрос на выдачу массива
		if (frame[0]==((CorrConf[0]->OurMBAddress)&0xff)) //запросы на чтение - только по основному адресу
		  {
		  temp=(frame[4]<<8)|frame[5];
		  addr=(frame[2]<<8)|frame[3];
			if (temp>100) temp=100; //если запрошено больше 100 регистров, то отдаём только первые 100 (буфер-то не резиновый)
		  frame[2]=temp*2;		//кол-во байт данных в пакете
		  for (i=0; i<temp; i++)
		    {
			  frame[i*2+4]=(p_devconf[i+addr])&0xff;		   //копируем данные в отправочный массив
			  frame[i*2+3]=(p_devconf[i+addr])>>8;
		    }
		  NumBytesToSend=temp*2+5;  //длина ответа c crс
		  }
		break;
		case 6: 	//запрос на запись регистра
		addr=(frame[2]<<8)|frame[3];	      //считаем адрес
		(p_devconf[addr])=(frame[4]<<8)|frame[5];	//копируем дату
			NumBytesToSend=8;  //длина ответа c crc (ответ равен запросу)
			break;
		default:
		frame[1]|=0x80;  //устанавливаем бит ошибки
		frame[2]=1;	 //неподдерживаемая команда
		NumBytesToSend=5;  //длина ответа c crc
		break;
		}

	  crc16=calculateCRC(frame, NumBytesToSend-2);
	  frame[NumBytesToSend-2]=crc16>>8;
	  frame[NumBytesToSend-1]=crc16 & 0xff;
	  GPIO_SetBits(GPIOA, GPIO_Pin_1);   // передача вкл
	  USART_SendData(USART2, frame[0]);	     //первый байт пошёл, остальные - в прерывании от уарта
	  RTCounter=1;	  //число отправленных байт
	  }
	}

      }
    if (!GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_1))  //если передача не включена
		RTCounter=0;				 //готовимся к приёму следующего пакета
}


//	  GPIO_SetBits(GPIOA, GPIO_Pin_1);   // передача вкл
//	USART_SendData(USART2, 0x55);// Last Version USART_SendData(USART1,(uint16_t) *pucBuffer++);
//	while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)  //ждём конца передачи
//		{
//		}
//	  GPIO_ResetBits(GPIOA, GPIO_Pin_1);	   // передача выкл

//--------- i2c -------------------------------------------------------------------------

