integrarium/stm32_ventil_slave/main.c
u8 i2c_error;

void init_I2C(I2C_TypeDef* I2Cx)
  {
    I2C_InitTypeDef i2c;
    // настройка I2C
    i2c.I2C_ClockSpeed = 100000;
    i2c.I2C_Mode = I2C_Mode_I2C;
    i2c.I2C_DutyCycle = I2C_DutyCycle_2;
    i2c.I2C_OwnAddress1 = 0x15;  //для мастера любой, кроме 0
    i2c.I2C_Ack = I2C_Ack_Enable;
    i2c.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_Init(I2C1, &i2c);
  }

// i2c инициализация
//****** по I2C2 идёт обмен с главным МК, тут только слейв *************************************************************
/*
void init_I2C2(void)
{
	GPIO_InitTypeDef gpio;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);

    init_I2C(I2C2);
	// ноги I2C2
    gpio.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
    gpio.GPIO_Mode = GPIO_Mode_AF_OD ;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &gpio);

	I2C_Cmd(I2C2, ENABLE);
}
*/
//********** по I2C1 работают датчики давления. порт мультиплексируется между PB6-PB7 и PB8-PB9 *****************************
void init_I2C1(void)
{
	GPIO_InitTypeDef gpio;
	// Включаем тактирование нужных модулей
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);


    init_I2C(I2C1);

    // ноги I2C1
    gpio.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
    gpio.GPIO_Mode = GPIO_Mode_IPU ;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &gpio);

    // ноги I2C1 2й вариант, включим его пока на вход с подтяжкой вверх
    gpio.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
    gpio.GPIO_Mode = GPIO_Mode_AF_OD ;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &gpio);

    GPIO_PinRemapConfig( GPIO_Remap_I2C1 , ENABLE );

//    GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C1);
//    GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_I2C1);
    // включаем I2C1
    I2C_Cmd(I2C1, ENABLE);
}
//*******************************************************************************************************
void I2C_StartTransmission(I2C_TypeDef* I2Cx, uint8_t transmissionDirection,  uint8_t slaveAddress)
{
    // На всякий слуыай ждем, пока шина осовободится
	SetTimingDelay(10);
	while(I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))	  if (GetTimingDelay()==0) { i2c_error=1;break;  }
    if	(I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))
	{
//	while(1); //пипец

	}

    // Генерируем старт
    I2C_GenerateSTART(I2Cx, ENABLE);
    // Ждем пока взлетит нужный флаг
	SetTimingDelay(10);
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		  if (GetTimingDelay()==0) {i2c_error=2;break;}
    // Посылаем адрес подчиненному
    I2C_Send7bitAddress(I2Cx, slaveAddress, transmissionDirection);
    // А теперь у нас два варианта развития событий - в зависимости от выбранного направления обмена данными
	SetTimingDelay(10);
    if(transmissionDirection== I2C_Direction_Transmitter)
    {
	while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
				if (GetTimingDelay()==0) {i2c_error=3;break;}
    }
    if(transmissionDirection== I2C_Direction_Receiver)
    {
      while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
			if (GetTimingDelay()==0) {i2c_error=4;break;}

    }
}

/***************************************************************************************/
void I2C_WriteData(I2C_TypeDef* I2Cx, uint8_t data)
{
    I2C_SendData(I2Cx, data);
	SetTimingDelay(10);
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	     if (GetTimingDelay()==0) {i2c_error=5;break;}
}
/***************************************************************************************/
uint8_t I2C_ReadData(I2C_TypeDef* I2Cx)
{
    uint8_t data;

//ждём
	SetTimingDelay(10);
     while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED))
	   if (GetTimingDelay()==0) {i2c_error=6;break;}

//опять ждём
	SetTimingDelay(10);
	while(!(I2Cx->SR1 & I2C_SR1_RXNE)) if (GetTimingDelay()==0) {i2c_error=7;break;}

//читаем
	data = I2Cx->DR;

	return data;
}

/***************************************************************************************/
void XGZP_WriteByte(I2C_TypeDef* I2Cx, uint8_t addr, uint8_t data)
  {
    if (i2c_error>0) return;
	I2C_StartTransmission(I2Cx,I2C_Direction_Transmitter,0xDA);
    I2C_WriteData(I2Cx,addr);
    I2C_WriteData(I2Cx,data);
    I2C_GenerateSTOP(I2Cx, ENABLE);
  }
/***************************************************************************************/
uint8_t XGZP_ReadByte(I2C_TypeDef* I2Cx, uint8_t addr)
  {
    if (i2c_error>0) return 0;
    uint8_t tmp;
	I2C_StartTransmission(I2Cx,I2C_Direction_Transmitter,0xDA);
    I2C_WriteData(I2Cx,addr);
    I2C_GenerateSTOP(I2Cx, ENABLE);
    I2C_StartTransmission(I2Cx,I2C_Direction_Receiver,0xDA);
    I2C_AcknowledgeConfig(I2Cx,DISABLE);
    tmp=I2C_ReadData(I2Cx);
    I2C_GenerateSTOP(I2Cx, ENABLE);
    return tmp;
  }
/***************************************************************************************/
void hx711_clkpulse ()
  {
	 GPIOB->ODR|=(GPIO_ODR_ODR15);	  //SCK = 1    импульс начало
	 GPIOB->ODR|=(GPIO_ODR_ODR15);	  //SCK = 1    импульс начало
	 GPIOB->ODR|=(GPIO_ODR_ODR15);	  //SCK = 1    импульс начало
	//Count=Count^0x800000;
	 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0  импульс конец
	 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0  импульс конец
	 GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0  импульс конец
  }

//------ FLASH --------------------------------------------------------

uint32_t Read_Flash(uint32_t Data_adr)
{
   return *(uint32_t*) Data_adr;

}

//поиск позиции последнего непустого слова в странице flash
u16 FlashSearch (uint8_t ParNum)
  {
  u16 i;
  u32 PageAddr=FlashLastPageAddr-ParNum*FlashPageSize;
  for (i=FlashPageSize/2-1; i>0; i--)
    {
    if (((uint16_t*)PageAddr)[i] < 0xffff)  break;
    }
  return i;
  }

// чтение параметра по его номеру из флеша
u16 ReadFlashParam(uint8_t ParNum)
  {
	u16 idx;
	idx = FlashSearch(ParNum);
	return ((uint16_t*)(FlashLastPageAddr-ParNum*FlashPageSize))[idx];

//    return *(uint16_t*)(PageAddr+FlashPageSize-2-i);
  }

// запись параметра с заданным номером во флеш
void WriteFlashParam(uint8_t ParNum, u16 ParValue)
  {
	u16 idx;
	idx = FlashSearch(ParNum);
    FLASH_Unlock();
	if ((idx==FlashPageSize/2-1) && (((uint16_t*)(FlashLastPageAddr-ParNum*FlashPageSize))[idx])<0xffff)
	  {
	  FLASH_ErasePage(FlashLastPageAddr-ParNum*FlashPageSize);	  //страница полностью записана - надо стереть
	  }
    if (((uint16_t*)(FlashLastPageAddr-ParNum*FlashPageSize))[idx]==0xffff)
		  FLASH_ProgramHalfWord  ( FlashLastPageAddr-ParNum*FlashPageSize,  ParValue  );   //чистая страница - пишем в начало
    else
	   FLASH_ProgramHalfWord  ( FlashLastPageAddr-ParNum*FlashPageSize+2*idx+2,  ParValue  );  //пишем в свободную ячейку (следующую за занятой)
	FLASH_Lock();
  }

