integrarium/stm32_ventil_slave/main.c
void FlashFill (void)
	{
    u16 i, temp16;
	for (i=0; i<ParNumTableSize; i++)
	  {
	  temp16 = ReadFlashParam(i);
	  if (temp16==0xffff)  //во флеше пусто - запишем туда из озу
		WriteFlashParam(i, dev_conf[0].devConfig[ParNumTable[i]]);     //ram->flash
	  else dev_conf[0].devConfig[ParNumTable[i]]=ReadFlashParam(i); //иначе flash->ram
	  }
	}

void FlashSyncronize (void)
  {
    u16 i, temp16;
	for (i=0; i<ParNumTableSize; i++)
	  {
	  temp16 = ReadFlashParam(i);
	  if (temp16!=dev_conf[0].devConfig[ParNumTable[i]])  //если есть отличие
		  WriteFlashParam(i, dev_conf[0].devConfig[ParNumTable[i]]);	 //ram->flash
	  }
  }

//------------------------------------------------------------------------------------

void BKPWriteAll(void)
  {
    u16 i, temp16;
    u16 buf[10];
    for (i=0; i<ParNumTableBKPSize; i++) //запись всех параметров в BKP
      {
      buf[i] = dev_conf[0].devConfig[ParNumTableBKP[i]];
      BKP_WriteBackupRegister(BKP_DR1+i*4,buf[i]); //ram->bkp
      }
    temp16 = calculateCRC(buf, 18); //новая crc
    BKP_WriteBackupRegister(BKP_DR1+9*4,temp16); //запись CRC

  }

void BKPFill (void)
	{
    u16 i, temp16;
    u16 buf[10];
	for (i=0; i<BKPSize; i++) //читаем весь BKP
	  {
	  buf[i] = BKP_ReadBackupRegister(BKP_DR1+i*4);
	  }
    temp16 = calculateCRC(buf, (BKPSize-1)*2); //Проверяем целостность данных

    if (temp16!=buf[BKPSize-1])  //если данные BKP неверные - запишем туда из озу
      {
      BKPWriteAll();
      VentConf->con_alarm|=1;
      }
    else
      {
	for (i=0; i<ParNumTableBKPSize; i++) dev_conf[0].devConfig[ParNumTableBKP[i]]=buf[i]; //читаем все параметры из BKP
	VentConf->con_alarm&=~1;

	  }
	}
/*
void BKPSyncronize (void)
  {
    u16 i, temp16;
	for (i=0; i<ParNumTableSize; i++)
	  {
	  temp16 = ReadFlashParam(i);
	  if (temp16!=dev_conf[0].devConfig[ParNumTable[i]])  //если есть отличие
		  WriteFlashParam(i, dev_conf[0].devConfig[ParNumTable[i]]);	 //ram->flash
	  }
  }
*/

//------------------------------------------------------------------------------------

u32 compil_date = __DATE__;

int main(void)
{
	u16 temp16;
	u16 i;
    s16 press;
    s32 press32;
    s16 temper;
    u32 Count;
    //u16 Count_time;
    char debugstr[100];
    u16 PrevmSecondCounter; //предыдущее значение счётчика миллисекунд
    u8 hx710_phase=0;
    u16 GateWayState=0;
    u8 Slave_Err; // ошибки слейва

	//u16 kf_press1, kf_press2; // переменные коэф пропорциональности

    integrator=0;
    RCC_ClocksTypeDef RCC_Clocks;

	RCC_Configuration();
	init_gpio();
    __disable_irq(); //Глобальное выключение прерывания

    RCC_GetClocksFreq(&RCC_Clocks);
    SysTick_Config(RCC_Clocks.HCLK_Frequency / 1000);

    RTC_Init();
    ADC_Config();
    DMA_Configuration(&DMA_InitStructure);

    Timer1_Config(RCC_Clocks.HCLK_Frequency);
    Timer2_Config(RCC_Clocks.HCLK_Frequency);
    Timer3_Config(RCC_Clocks.HCLK_Frequency);
    usart_init();

    init_I2C1();
    //	  init_I2C2();
    CorrConf[0]=&dev_conf[0];
    CorrConf[1]=&dev_conf[1];
    VentConf=&dev_conf[2];
    // начальные значения настроек в случае отсутствия их во флеше
    CorrConf[0]->OurMBAddress = 2; //ardress modbus (датчик перепада на фильтре)
    //	  CorrConf[1]->OurMBAddress=3; //больше не участвует в работе // ardress modbus (датчик потока на двигателе)
    //	  CorrConf[0]->temper_base=20; //больше не участвует в работе // температура базовая
    //	  CorrConf[1]->temper_base=20; //температура базовая больше нет. настройка по первому регистру
    CorrConf[0]->WorkMode=1;   //вкл режим "шлюз" односторонний, уф включен
    VentConf->Kfactor = 77; //
    VentConf->flaw_set1 = 1000; //уставка потока 1
    VentConf->flaw_set1 = 500;	//уставка потока 2
    VentConf->min_pres = 60; //нижнее давление для определения аварии фильтра
    VentConf->max_pres = 350; //верхнее давление для определения аварии фильтра
    VentConf->Version = 102; //Номер версии slave прошивки
    CorrConf[0]->FFMnumber=1; //количество ФВМ
    CorrConf[0]->InFanPower=1000; // мощность мотора
    VentConf->fan_on=0;
//	VentConf->UVSecondCounter=BKP_ReadBackupRegister(BKP_DR1); //наработку в секундах берём из бакап-озу (на батарейке)
    CorrConf[0]->PCA9534_3 =0xf0; //старший полубайт PCA9534 на выход
    CorrConf[0]->LightTime =20; //Время освещения
    CorrConf[0]->BlowTime =30;	// Время обработки
    CorrConf[0]->CheckTime =7;	// Время до проверки

    FlashFill();
    BKPFill();

    //GA_Adress=CorrConf[0]->OurMBAddress;  //адрес на слейв-и2ц = адресу на модбасе
    GA_Adress=0x0f;  //адрес на слейв-и2ц 0f
    ADC_TempSensorVrefintCmd(ENABLE);
    ADC_DMA_buffer[0]=0;
    ADC_DMA_buffer[1]=0;

     Init_I2C_Slave();

    __enable_irq(); //Глобальное включение прерывания

//    SW_I2C_initial();
//    i2c_port_initial(SW_I2C2);


    // три старших бита порта PCA9534 на выход
//    SW_I2C_WriteControl_8Bit(SW_I2C2,0x40,3,0x1f);

//	      I2C_StartTransmission(I2C2,I2C_Direction_Transmitter,0x40);
//	      I2C_WriteData(I2C2,3);
//	      I2C_WriteData(I2C2,0x1f);
//	      I2C_GenerateSTOP(I2C2, ENABLE);
    SecondCounter=0;

    while (1)
    {
	FlashSyncronize();
	BKPWriteAll();

	//реостат
	CorrConf[0]->rheostat=temperature_data[0];
		//(3469.2/(log(temperature_data[0]/(4096-temperature_data[0]))+3469.2/298.15)-273.15)*100;
	//температура МК
	CorrConf[0]->temperature= ((1750.0-temperature_data[1])/5+25)*100;
	if (CorrConf[0]->OurMBAddress==0) CorrConf[0]->OurMBAddress=1;

	if ((VentConf->filter_alarm>0) || (VentConf->fan_alarm>0)) VentConf->main_alarm=1;
	else VentConf->main_alarm=0;

	PrevmSecondCounter=mSecondCounter;

	if (((CorrConf[0]->WorkMode & 1)==0)	      //режим регулятора
			&& (VentConf->fan_power==0))
		VentConf->fan_alarm = 0; // сброс аварии мотора

	if (VentConf->set_select == 0) CorrConf[0]->ustav = VentConf->flaw_set1;
	else CorrConf[0]->ustav = VentConf->flaw_set2;

	if (VentConf->LightOn==1) GPIO_SetBits(GPIOB, GPIO_Pin_2);
	else  GPIO_ResetBits(GPIOB, GPIO_Pin_2);

	if (VentConf->UV_on==1) GPIO_SetBits(GPIOB, GPIO_Pin_1);
	else  GPIO_ResetBits(GPIOB, GPIO_Pin_1);

