integrarium/stm32_ventil_slave/main.c
      // запись значения давления второго канала в регистр
		CorrConf[1]->press_i2c=CorrConf[1]->filter*10/16;

	  //	 dev_conf[1].devConfig[0x11]=CorrConf[1]->press_i2c;
//	  CorrConf[1]->press_i2c/=2;
//	dev_conf[1].devConfig[0x11]>>=4;
 //	CorrConf[1]->press_i2c=dev_conf[1].devConfig[0x11];
	//CorrConf[1]->press_i2c = ( press - CorrConf[1]->press_offset + CorrConf[1]->tcomp_offset ) * (100+CorrConf[1]->kf_press)/100;

		if ((CorrConf[0]->WorkMode & 1)==0) //режим "шлюз" выключен
		{
			if (VentConf->set_select == 0) //первая уставка
				if (VentConf->fan_on != 0) //вентилятор включен
					if (abs(VentConf->cur_flaw - CorrConf[0]->ustav)<(CorrConf[0]->ustav / 5)) //если текущий поток в пределах -20% +20% от уставки - можно выдавать аварию фильтра
						if (CorrConf[1]->press_i2c/10 > VentConf->max_pres) VentConf->filter_alarm = 1;
						else if (CorrConf[1]->press_i2c/10 < VentConf->min_pres) VentConf->filter_alarm = 2;
						else VentConf->filter_alarm = 0;
					else VentConf->filter_alarm = 0;  //поток меньше 80% или больше 120% от заданного - нет аварии фильтра
				else VentConf->filter_alarm = 0;	//вентилятор выключен - нет аварии фильтра
			else VentConf->filter_alarm = 0;	//вторая уставка - нет аварии фильтра
		}
		else //режим "шлюз"
		{
		}

		CorrConf[1]->i2c_success_count++;
		CorrConf[1]->i2c_sens_error = 0; //нет ошибок
	    }

  //			  (temp16- 1024.0) / 6.0 - 5000;

	    else
	    {
		CorrConf[1]->i2c_sens_error = i2c_error; //ошибка датчика
		i2c_error=0;
		I2C1->CR1 |= I2C_CR1_SWRST; //reset
// конфигурируем ножки на выход (иногда слетала конфигурация)
		GPIOB->CRL |= GPIO_CRL_CNF6_0 | GPIO_CRL_CNF6_1 |GPIO_CRL_CNF7_0 | GPIO_CRL_CNF7_1;

		if (!((GPIOB->IDR) & (1<<7))) //слейв держит шину
		{
			while  (!((GPIOB->IDR) & (1<<7)))
			{
				GPIOB->CRL &= ~ GPIO_CRL_CNF6_1; //шлём клоки, пока слейв не отпуситит шину
				Delay(1);
				GPIOB->CRL |= GPIO_CRL_CNF6_1;
				Delay(1);
			}
		}

		Delay(10);
		I2C1->CR1 &= ~I2C_CR1_SWRST; //отпускаем reset
		init_I2C(I2C1); //инит i2c после ресета
	    }

	    //отключаемся от 2го датчика
	    GPIOB->ODR |= GPIO_ODR_ODR6 | GPIO_ODR_ODR7;
	    GPIOB->CRL &= ~GPIO_CRL_CNF6_0 & ~GPIO_CRL_MODE6_1 & ~GPIO_CRL_MODE6_0 & ~GPIO_CRL_CNF7_0 & ~GPIO_CRL_MODE7_1 & ~GPIO_CRL_MODE7_0;
	    //подключаемся к 1му датчику
	    GPIO_PinRemapConfig( GPIO_Remap_I2C1 , ENABLE );
	    GPIOB->CRH |= GPIO_CRH_CNF8_0 | GPIO_CRH_MODE8_1 | GPIO_CRH_MODE8_0 | GPIO_CRH_CNF9_0 | GPIO_CRH_MODE9_1 | GPIO_CRH_MODE9_0;
	    GPIOB->ODR &= ~GPIO_ODR_ODR8 & ~GPIO_ODR_ODR9;


// ------------------------ I2C обмен -------------------------------------------------------------

	    RxBuffer[1]=Slave_Err;
	    //VentConf->LightOn=RxBuffer[0];

// ----------------------- читаем с hx710 температуру и давление -------------------------------------

	    GPIOB->ODR&=~(GPIO_ODR_ODR15);    //SCK = 0
	    Count=0;
	    if (!(GPIOB->IDR&(GPIO_IDR_IDR14)))
	    {
		for (i=0;i<24;i++)
		{
			hx711_clkpulse (); //импульс на clk
			Count<<=1;
			if(GPIOB->IDR&(GPIO_IDR_IDR14)) Count++;
		}
		hx711_clkpulse (); //25й импульс
		hx711_clkpulse (); //26й импульс
		if (hx710_phase==0) //была фаза давления
		{
			hx710_phase=1; //переключаемся на температуру
			VentConf->HX711_press=Count>>8;
		}
		else
		{
			VentConf->HX711_temper=(Count-2560000)>>7;
			hx710_phase=0; //переключаемся на давление
			hx711_clkpulse (); //27й импульс
		}
	    }

// **************** логика режима "шлюз" слейв ********************************************************

	    // обработка регистра debug
	    if (VentConf->debug ==1 ) { CorrConf[0]->WorkMode &= ~0x01; } // бит шлюза сбрасываем
	    else { CorrConf[0]->WorkMode |= 0x01; } // бит шлюза устанавливаем

	    u16 LightOnMoment, FanOnMoment, CheckOnMoment;

	    if (CorrConf[0]->WorkMode & 1) //режим "шлюз"
	    {
		VentConf->fan_on=0; //выкл регулятора

		switch (GateWayState)
		{
		case 0: //ждём начала обработки

			TIM3->CCR3=0;	    //выкл вентилятора
			VentConf->fan_power=0;	 //
			VentConf->UV_on=0; //выкл УФ
			CorrConf[0]->PCA9534_1 &= ~0xf0; //разблокировка дверей,  выкл светофор, выкл пищалки
			if (SecondCounter-LightOnMoment>CorrConf[0]->LightTime)   VentConf->LightOn=0; //выкл свет

			if (RxBuffer[0] == 1) //начат цикл
			{
				VentConf->LightOn=1; //вкл свет
				CorrConf[0]->PCA9534_1 &= ~0x10; // выкл пищалки
				TIM3->CCR3=CorrConf[0]->InFanPower*65535/10000;       //вкл вентилятора
				VentConf->fan_power=CorrConf[0]->InFanPower;   //
				FanOnMoment=SecondCounter; //взводим таймер выключения вентилятора
				if ((CorrConf[0]->WorkMode & 4)==0)  //уф включен
				{
					VentConf->UV_on=1; //вкл УФ
				};
				GateWayState=3;
				CheckOnMoment =SecondCounter; // взводим таймер проверки фильтра
			};

			break;

		case 3:  //ждём окончания цикла обработки


			//если время обработки закончилось переходим в начальное состояние
			if (RxBuffer[0] == 0) //окончен цикл
			{
				GateWayState=4;
			}

			//если время ожидания проверки закончилось - начинаем проверку значений
			if (SecondCounter-CheckOnMoment > CorrConf[0]->CheckTime)
			{

				// главный регистр аварии - индикация аварии на главном экране
				if ((VentConf->filter_alarm>0) || (VentConf->fan_alarm>0) )
				{
					VentConf->main_alarm=1;
					Slave_Err |= 2; // ОБЩАЯ авария на слейве
				}
				else
				{
					VentConf->main_alarm=0;
					Slave_Err &= ~2; // нет ОБЩЕЙ аварии фильтра на слейве
				};

				// Проверка аварии 1 мотора
				if (CorrConf[0]->FanSpeed < 5 )
				{
					VentConf->fan_alarm |= 1;
				}
				else
					VentConf->fan_alarm &= ~1;

				// Проверка макс давления на фильтре 1
				if (VentConf->max_pres*10 < CorrConf[0]->press_i2c )
				{
					VentConf->filter_alarm |= 1;
				}
				else
				{
					VentConf->filter_alarm &= ~1;  //сброс ошибки засора фильтра
				};

				// Проверка мин давления на фильтре 1
				if (VentConf->min_pres*10 > CorrConf[0]->press_i2c )
				{
					VentConf->filter_alarm |= 2;
					Slave_Err |= 1; // Порыв фильтра на слейве
				}
				else
				{
					VentConf->filter_alarm &= ~2;  //сброс ошибки порыва первого фильтра
				    Slave_Err &= ~1; // нет Порыва фильтра на слейве
				};

				// если ФВМ 2 и более, то проверяем второй
				if (CorrConf[0]->FFMnumber > 1)
	    		{
					// Проверка аварии 2 мотора
					if (CorrConf[1]->FanSpeed < 5 )
					{
						VentConf->fan_alarm |= 2;
					}
					else
						VentConf->fan_alarm &= ~2;

					// Проверка макс давления на фильтре 1
					if (VentConf->max_pres*10 < CorrConf[1]->press_i2c )
					{
						VentConf->filter_alarm |= 1;
					}
					else
					{
						VentConf->filter_alarm &= ~1;  //сброс ошибки засора фильтра
					};

					// Проверка мин давления на 2 фильтре
					if (VentConf->min_pres*10 > CorrConf[1]->press_i2c )
					{
						VentConf->filter_alarm |= 8;
						Slave_Err |= 1; // Порыв фильтра на слейве
					}
					else
					{
						VentConf->filter_alarm &= ~8;  //сброс ошибки порыва второго фильтра
						Slave_Err &= ~1; // нет Порыва фильтра на слейве
					};
				};
			}


			break;

		default:
			LightOnMoment = SecondCounter; //взводим световой таймер
			GateWayState=0;
			break;
		} //end switch
	    } //режим шлюз

	    VentConf->debug2 = stop_count;
	    //меняем состояние светодиода
	    GPIO_WriteBit(GPIOC, GPIO_Pin_15, !GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_15));

    } //end While
} // end main
